Repository: Arctanyn/Text-Processing-App
Catalog: Text-Processing/Resources/Localizable.xcstrings
Source language: ru
Languages: en

# categories.title
source: Категории
en: Categories

# choose.file
source: Выбрать файл
en: Choose file

# close.text
source: Закрыть
en: Close

# done.keyboard.button.title
source: Готово
en: Done

# make.summary.button.title
source: Сделать выжимку
en: Make summary

# processing.text
source: Обработка
en: Processing

# summarization.level.high
source: Высокая
en: High

# summarization.level.low
source: Низкая
en: Low

# summarization.level.medium
source: Средняя
en: Medium

# summarization.level.very.high
source: Очень высокая
en: Very high

# summarization.level.very.low
source: Очень низкая
en: Very low

# summarized.text
source: Выжимка из текста
en: Summarized text

# symbols.count
source: Количество символов
en: Symbols count

# text.ask.questions.description
source: Задавайте вопросы, основанные на содержании текста
en: Ask questions based on the content of the text

# text.compression.ratio
source: Степень сжатия
en: Compression ratio

# text.input.placeholder
source: Введите текст здесь...
en: Enter your text here...

# text.processing.title
source: Обработка текста
en: Text Processing

# text.summary.description
source: Получите краткое изложение из текста, регулируя степень сжатия исходной информации
en: Get a summary from the text by controlling the compression ratio of the source information

# text.summary.page.title
source: Выжимка текста
en: Summary

# text.summary.title
source: Сделать выжимку
en: Summary

# words.count
source: Количество слов
en: Words count

source: Амхарский
en: Amharic

source: Английский
en: English

source: Арабский
en: Arabic

source: Армянский
en: Armenian

source: Бенгальский
en: Bengali

source: Бирманский
en: Burmese

source: Болгарский
en: Bulgarian

source: В этом чате пока пусто
en: This chat is empty

source: Ваша речь еще не распознана
en: Your speech has not been recognized yet

source: Введите свой вопрос
en: Enter your question

source: Венгерский
en: Hungarian

source: Вьетнамский
en: Vietnamese

source: Голландский
en: Dutch

source: Греческий
en: Greek

source: Грузинский
en: Georgian

source: Гуджарати
en: Gujarati

source: Датский
en: Danish

source: Для преобразования речи в текст нажмите на кнопку записи
en: To convert speech to text, click on the record button

source: Задать вопросы
en: Ask Questions

source: Здесь будут отображаться ваши вопросы по тексту и сгенерированные ответы на них
en: Your questions about the text and the generated answers to them will be displayed here

source: Иврит
en: Hebrew

source: Индонезийский
en: Indonesian

source: Исландский
en: Icelandic

source: Испанский
en: Spanish

source: Итальянский
en: Italian

source: Казахский
en: Kazakh

source: Каннада
en: Kannada

source: Каталонский
en: Catalan

source: Китайский (трад.)
en: Chinese (traditional)

source: Китайский (упр.)
en: Chinese (simplified)

source: Корейский
en: Korean

source: Кхмерский
en: Khmer

source: Лао
en: Lao

source: Малайский
en: Malay

source: Малаялам
en: Malayalam

source: Маратхи
en: Marathi

source: Монгольский
en: Mongolian

source: Начните запись для преобразования вашей речи в текст
en: Start recording to convert your speech to text

source: Немецкий
en: German

source: Норвежский
en: Norwegian

source: Обработка
en: Processing

source: Обработка текста и речи
en: Text and speech processing

source: Ория
en: Oriya

source: Панджаби
en: Punjabi

source: Персидский
en: Persian

source: Польский
en: Polish

source: Португальский
en: Portuguese

source: Преобразуйте текст на любом языке в аудио и наоборот
en: Convert text in any language to audio and vice versa

source: Речь в текст
en: Speech to text

source: Румынский
en: Romanian

source: Русский
en: Russian

source: Сингальский
en: Sinhalese

source: Словацкий
en: Slovak

source: Тайский
en: Thai

source: Тамильский
en: Tamil

source: Текст в речь
en: Text to speech

source: Телугу
en: Telugu

source: Тибетский
en: Tibetan

source: Турецкий
en: Turkish

source: Украинский
en: Ukrainian

source: Урду
en: Urdu

source: Финский
en: Finnish

source: Французский
en: French

source: Хинди
en: Hindi

source: Хорватский
en: Croatian

source: Чероки
en: Cherokee

source: Чешский
en: Czech

source: Шведский
en: Swedish

source: Японский
en: Japanese
